/*
날짜 : 2024. 6. 24
이름 : 배성훈
내용 : 객체지향 프로그래밍의 이해
	교재 p136 ~ 

	구조체를 확장한 것이 클래스라고 인식하는 것은 문제가 되지 않으나,
	그것이 전부는 아니다 객체지향의 관점에서 클래스를 보자

	C++은 객체지향 언어이고 C는 절차지향 언어이다
	절차지향적 특서잉 갖지 못하는 많은 장점을 객체지향은 지니고 있지만,
	그러나 절차지향도 그 나름의 장점이 있다

	객체는 영어로 Object이다 C++에서 말하는 Object는 사물, 또는 대상이다
	객체지향 프로그래밍은 현실에 존재하는 사물과 대상,
	그리고 그에 따른 행동을 있는 그대로 실체화시키는 프로그래밍이다

	객체는 하나 이상의 상태 정보(데이터)와 하나 이상의 행동(기능)으로 구성이 되며
	상태 정보는 변수를 통해서 표현이 되고(변수에 상태 정보를 저장할 수 있다),
	행동은 함수를 통해서 표현이 된다

	객체를 생성하기에 앞서 객체의 생성을 위한 틀(mold)를 먼저 만들어야 한다
	현실 세계에서 물건을 만들기 위해 틀을 짜는 행위에 비유할 수 있다
	
	함수와 변수를 이용해서 틀을 만들면
	우리가 아는 클래스의 정의가 된다
*/